public_html/Books Review/Data Structures&Algorithm Analysis in C++(Second Edition)_Weiss/Data Structures&Algorithm Analysis in C++(Second Edition).html
<?xml version="1.0" encoding="iso-8859-1"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Data Structures&amp;Algorithm Analysis in C++(Second Edition)</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1"/>
<meta name="title" content="Data Structures&amp;Algorithm Analysis in C++(Second Edition)"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2012-09-13 23:14:49 HKT"/>
<meta name="author" content="Shi Shougang"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>
<link rel="stylesheet" href="./assets/stylesheet.css" type="text/css"/>
<link rel="stylesheet" type="text/css" href="../../assets/stylesheet.css" />

</head>
<body>
<div id="org-div-home-and-up" style="text-align:right;font-size:70%;white-space:nowrap;">
 <a accesskey="h" href="../../index.html"> UP </a>
 |
 <a accesskey="H" href="../../index.html"> HOME </a>
</div>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">Data Structures&amp;Algorithm Analysis in C++(Second Edition)</h1>



<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">Sites</a>
<ul>
<li><a href="#sec-1-1">FTP</a></li>
<li><a href="#sec-1-2">author homepage</a></li>
<li><a href="#sec-1-3">source codes</a></li>
</ul>
</li>
<li><a href="#sec-2">Notes</a>
<ul>
<li><a href="#sec-2-1"></a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1">Sites</h2>
<div class="outline-text-2" id="text-1">


</div>

<div id="outline-container-1-1" class="outline-3">
<h3 id="sec-1-1">FTP</h3>
<div class="outline-text-3" id="text-1-1">

<p>ftp.awl.com
</p></div>

</div>

<div id="outline-container-1-2" class="outline-3">
<h3 id="sec-1-2">author homepage</h3>
<div class="outline-text-3" id="text-1-2">

<p><a href="http://users.cis.fiu.edu/~weiss/">http://users.cis.fiu.edu/~weiss/</a>
</p></div>

</div>

<div id="outline-container-1-3" class="outline-3">
<h3 id="sec-1-3">source codes</h3>
<div class="outline-text-3" id="text-1-3">

<ul>
<li><a href="http://users.cis.fiu.edu/~weiss/dsaa_c++/code/">http://users.cis.fiu.edu/~weiss/dsaa_c++/code/</a>
</li>
<li><a href="http://users.cis.fiu.edu/~weiss/dsaa_c++/code/g++.txt">http://users.cis.fiu.edu/~weiss/dsaa_c++/code/g++.txt</a>
</li>
<li><a href="http://users.cis.fiu.edu/~weiss/adspc++2/code/">http://users.cis.fiu.edu/~weiss/adspc++2/code/</a>
</li>
</ul>

<ul>
<li id="sec-1-3-1">codes review<br/>
Global Utilities

<p>
StartConv.h 
EndConv.h 
getline.cpp
Chapter 1: Arrays, Pointers, Structures
</p>
<p>
ArrayDemo.cpp 
GetInts.cpp 
TestString.cpp 
TestSwap.cpp
Chapter 2: Classes
</p>
<p>
IntCell.h  IntCell.cpp  TestIntCell.cpp 
BuggyIntCell.cpp 
DeepIntCell.cpp 
Rational.h  Rational.cpp  RatMain.cpp 
mystring.h  string.cpp
Chapter 3: Templates
</p>
<p>
FuncTemplates.cpp 
InsSort.cpp 
MemoryCell.h  MemoryCell.cpp  TestMemoryCell.cpp 
Matrix.h 
vector.h  vector.cpp
Chapter 4: Inheritance
</p>
<p>
Except.h 
Shape.cpp  
Hiding.cpp 
StaticBinding.cpp
Chapter 5: Patterns
</p>
<p>
Rectangle.cpp 
Wrapper.h 
Ambiguity.cpp 
AutoPtr.cpp 
StorageCell.h TestStorageCell.cpp 
Iterator1.cpp 
Iterator2.cpp 
Iterator3.cpp 
pair.h 
Observer.cpp
Chapter 6: Running Times
</p>
<p>
MaxSum.cpp 
BinarySearch.cpp
Chapter 7: STL
</p>
<p>
vector.h  vector.cpp 
functional.h TestFunctional.cpp 
algorithm.h 
SimpleSetDemo.cpp 
TestPQ.cpp
Chapter 8: Recursion
</p>
<p>
RecSum.cpp 
PrintInt.cpp 
BinarySearchRec.cpp 
Ruler.java 
FractalStar.java 
Math.cpp 
MaxSum.cpp 
MkChnge.cpp 
TicTacSlow.cpp
Chapter 9: Sorting
</p>
<p>
Duplicate.cpp 
Sort.h  TestSort.cpp
Chapter 10: Randomization
</p>
<p>
Random.h  Random.cpp  RandTest.cpp 
Permute.cpp 
Math.cpp
Chapter 11: Fun and Games
</p>
<p>
WordSrch.cpp 
TicTac.cpp
Chapter 12: Applications of Stacks &ndash; Compilers and Parsing
</p>
<p>
Tokenizer.h  Tokenizer.cpp  Balance.cpp 
Infix.cpp
Chapter 13: Utilities
</p>
<p>
Hzip.cpp 
Tokenizer.h  Tokenizer.cpp  Xref.cpp
Chapter 14: Simulation
</p>
<p>
Josephus.cpp 
Modems.cpp
Chapter 15: Shortest Path Algorithms
</p>
<p>
Paths.cpp Note for DotNet users: on line 40 of PairingHeap.cpp, insert the word typename in front of the line so it appears as typename PairingHeap::Position
Chapter 16: Stacks
</p>
<p>
StackAr.h  StackAr.cpp  TestStackAr.cpp 
StackLi.h  StackLi.cpp  TestStackLi.cpp 
QueueAr.h  QueueAr.cpp  TestQueueAr.cpp 
QueueLi.h  QueueLi.cpp  TestQueueLi.cpp
Chapter 17: Linked Lists
</p>
<p>
LinkedList.h  LinkedList.cpp  SortLinkedList.h  SortLinkedList.cpp  TestLinkedList.cpp 
list.h  list.cpp  TestList.cpp
Chapter 18: Trees
</p>
<p>
BinaryTree.h  BinaryTree.cpp 
Iterate.h  Iterate.cpp  TestBinaryTree.cpp
Chapter 19: Search Trees
</p>
<p>
BinarySearchTree.h  BinarySearchTree.cpp  TestBinarySearchTree.cpp 
RedBlackTree.h  RedBlackTree.cpp  TestRedBlackTree.cpp 
AATree.h  AATree.cpp  TestAATree.cpp 
set.h  set.cpp  TestSet.cpp 
map.h  map.cpp  TestMap.cpp
Chapter 20: Hash Tables
</p>
<p>
QuadraticProbing.h  QuadraticProbing.cpp  TestQuadraticProbing.cpp
Chapter 21: Heaps
</p>
<p>
BinaryHeap.h  BinaryHeap.cpp  TestBinaryHeap.cpp 
queue.h  queue.cpp  TestQueue.cpp
Chapter 22: Splay Trees
</p>
<p>
SplayTree.h  SplayTree.cpp  TestSplayTree.cpp
Chapter 23: Pairing Heaps
</p>
<p>
PairingHeap.h  PairingHeap.cpp  TestPairingHeap.cpp Note for DotNet users: on line 40 of PairingHeap.cpp, insert the word typename in front of the line so it appears as typename PairingHeap::Position
Chapter 24: Disjoint Sets
</p>
<p>
DisjSets.h  DisjSets.cpp  TestDisjSets.cpp
Appendix D: Primitive Arrays
</p>
<p>
PointerHopping.cpp
</p></li>
</ul>
</div>
</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2">Notes</h2>
<div class="outline-text-2" id="text-2">


</div>

<div id="outline-container-2-1" class="outline-3">
<h3 id="sec-2-1"></h3>
<div class="outline-text-3" id="text-2-1">


</div>
</div>
</div>
</div>

<div id="postamble">
<p class="date">Date: 2012-09-13 23:14:49 HKT</p>
<p class="author">Author: Shi Shougang</p>
<p class="creator">Org version 7.8.09 with Emacs version 24</p>
<a href="http://validator.w3.org/check?uri=referer">Validate XHTML 1.0</a>

</div>
</body>
</html>
